{
    "hi": "Hello there!",
    "hello": "Hi!",
    "hey": "Hey!",
    "how are you?": "I'm just a program, but I'm doing well. How about you?",
    "what's up?": "Not much, just processing data. How about you?",
    "good morning": "Good morning!",
    "good afternoon": "Good afternoon!",
    "good evening": "Good evening!",
    "good night": "Good night!",
    "how's the weather today?": "I'm sorry, I don't have real-time weather information.",
    "tell me a joke": "Why did the computer keep its drink on the windowsill? Because it wanted a byte!",
    "who is your creator?": "I was created by developers at OpenAI.",
    "what is the meaning of life?": "The meaning of life is a philosophical question that has puzzled humans for centuries.",
    "favorite color": "I don't have a favorite color, but I like all the colors!",
    "what's your name?": "You can call me ChatGPT.",
    "how old are you?": "I'm an artificial intelligence, so I don't have an age.",
    "where do you live?": "I exist in the digital realm, accessible through the internet.",
    "can you help me with math?": "Yes, I can help you with math problems. Feel free to ask!",
    "what is the capital of france?": "The capital of France is Paris.",
    "how do i change my password?": "To change your password, go to the settings menu and select the password option.",
    "tell me a fact": "The shortest war in history was between Britain and Zanzibar on August 27, 1896. Zanzibar surrendered after 38 minutes.",
    "who is the president of the united states?": "I don't have real-time information. Please check the latest news for the current president.",
    "thank you": "You're welcome!",
    "bye": "Goodbye! Have a great day!",
    "what is your favorite food?": "I don't eat, but I think pizza is a popular choice among humans.",
    "who wrote 'hamlet'?": "William Shakespeare wrote 'Hamlet'.",
    "what is the tallest mountain in the world?": "Mount Everest is the tallest mountain in the world.",
    "how many continents are there?": "There are seven continents: Africa, Antarctica, Asia, Europe, North America, Australia (Oceania), and South America.",
    "what is the capital of japan?": "The capital of Japan is Tokyo.",
    "what is the boiling point of water?": "The boiling point of water is 100 degrees Celsius (212 degrees Fahrenheit) at sea level.",
    "who invented the telephone?": "Alexander Graham Bell is credited with inventing the telephone.",
    "what is the chemical symbol for gold?": "The chemical symbol for gold is Au.",
    "what is the speed of light?": "The speed of light in a vacuum is approximately 299,792 kilometers per second.",
    "what is the square root of 144?": "The square root of 144 is 12.",
    "what is the largest mammal on earth?": "The blue whale is the largest mammal on Earth.",
    "who painted the mona lisa?": "Leonardo da Vinci painted the Mona Lisa.",
    "what is the currency of germany?": "The currency of Germany is the euro (€).",
    "what is the atomic number of carbon?": "The atomic number of carbon is 6.",
    "what is the capital of brazil?": "The capital of Brazil is Brasília.",
    "what is the formula for the area of a circle?": "The formula for the area of a circle is A = πr^2, where A is the area and r is the radius.",
    "what is the national animal of china?": "The national animal of China is the giant panda.",
    "who was the first person to walk on the moon?": "Neil Armstrong was the first person to walk on the moon.",
    "what is the chemical formula for water?": "The chemical formula for water is H2O.",
    "what is the largest planet in our solar system?": "Jupiter is the largest planet in our solar system.",
    "what is the capital of australia?": "The capital of Australia is Canberra.",
    "who is the author of 'to kill a mockingbird'?": "Harper Lee is the author of 'To Kill a Mockingbird'.",
    "what is the capital of france?": "The answer provided by the user",
    "what is the currency of japan?": "The currency of Japan is the yen (¥).",
    "who painted the sistine chapel ceiling?": "The Sistine Chapel ceiling was painted by Michelangelo.",
    "what is the largest ocean?": "The Pacific Ocean is the largest and deepest of Earth's oceanic divisions.",
    "who was the first person in space?": "Yuri Gagarin, a Soviet cosmonaut, was the first person to orbit the Earth in space on April 12, 1961.",
    "what is the meaning of ai?": "AI stands for Artificial Intelligence, which refers to the simulation of human intelligence in machines programmed to think and learn.",
    "how do you learn?": "I learn through the data and patterns in the text I'm trained on, but I don't have personal experiences or consciousness.",
    "tell me a riddle": "I have keys but open no locks. I have space but no room. You can enter, but you can't go inside. What am I? Answer: A keyboard.",
    "what is the capital of australia?": "The capital of Australia is Canberra.",
    "what is the largest animal on earth?": "The blue whale is the largest animal on Earth.",
    "what time is it?": "I'm sorry, I don't have access to real-time information.",
    "tell me a science fact": "The honeybee is the only insect that produces food eaten by humans.",
    "what is the currency of japan?": "The currency of Japan is the yen (¥).",
    "who painted the Sistine Chapel ceiling?": "The Sistine Chapel ceiling was painted by Michelangelo.",
    "what is the tallest mountain in the world?": "Mount Everest is the tallest mountain in the world.",
    "what is the largest animal on Earth?": "The blue whale is the largest animal on Earth."
}
